In [2]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:86% !important;}
div.cell.code_cell.rendered{width:100%;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:12px;}
</style>
"""))

In [ ]:
# 딕셔너리, 딕셔너리 리스트 리마인드

In [33]:
# 1. "age"를 23으로 바꾸세요
# 2. "hobby" : "독서" 를 추가하세요
# 3. "city" key를 삭제하세요
# 4. "gender" key를 조회할 때 없으면 "unknown"을 반환하게 하세요

info = {"name": "영희", "age": 22, "city": "대전"}

info['age'] = 23
info['hobby'] = '독서'
info.pop('city')
info.get('gender', 'unknown')

# 모든 학생에 대해 "name"과 "평균 점수" 를 출력하시오. (단, 평균은 소수 둘째 자리까지 출력)

students = [
    {"name": "철수", "kor": 80, "eng": 90, "math": 70},
    {"name": "영희", "kor": 85, "eng": 95, "math": 80},
    {"name": "민수", "kor": 75, "eng": 85, "math": 90}
]

for student in students:
    mean = (student['kor'] + student['eng'] + student['math'])/3
    print('{}의 평균점수는 {}점'.format(student.get('name'),
                                             round(mean,2)))
    
# 국어 점수가 80점 이상인 학생의 이름만 리스트로 추출하시오.
# 풀이 1.
print('국어 점수가 80점 이상인 학생 :', end=' ')
for student in students:
    if student['kor'] >= 80:
        print(f"{student['name']}", end=' ')
print()
#풀이 2.
result = [student['name'] for student in students if student['kor'] >= 80 ]
print('국어 점수가 80점 이상인 학생 :', result)

철수의 평균점수는 80.0점
영희의 평균점수는 86.67점
민수의 평균점수는 83.33점
국어 점수가 80점 이상인 학생 : 철수 영희
국어 점수가 80점 이상인 학생 : ['철수', '영희']

<b><font size="5" color="red">ch11_데이터프레임과 시리즈(Pandas)</font></b>

# 1절. 판다스 패키지
- pip install pandas / conda install pandas
- 데이터 분석을 위해 반드시 알아야할 패키지. 넘파이 기반으로 다른 많은 라이브러리와 잘 통합되도록 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임을 제공
- 판다스 장점 : 파일 io, 부분 데이터 추출, 크기변경, 데이터 분할, 병합, 정렬, 결측치 처리, 데이터분할, 피벗과 언피벗(와이드포맷과 롱모맷)에 용이

- [Pandas API referance](https://pandas.pydata.org/docs/reference/index.html)
- [Pandas Docs](https://pandas.pydata.org/docs/)

In [34]:
import pandas as pd
pd.__version__

'1.5.3'

In [39]:
data = pd.read_csv('data/ch09_member4.csv', header=, encoding='utf-8') # encoding='utf-8' 기본값
display(data)
type(data)

  name  age    email   address
0  홍길동   20  h@h.com   서울시 관악구
1  신길동   40  s@h.com  서울시 영등포구
2  김길동   30  k@h.com   서울시 동작구

pandas.core.frame.DataFrame

In [43]:
data = pd.read_csv('data/ch09_member1.csv',
                   header=None,
                   names=['name', 'age', 'email', 'address']         
                  )
data

  name  age             email   address
0  홍길동   20  kildong@hong.com   서울시 관악구
1  김길동   40  kimdong@hong.com  서울시 영등포구
2  신길동   30  sindong@hong.com   서울시 동작구

In [44]:
data = pd.read_json('data/ch09_member.json')
data

  name  age    email   address
0  홍길동   20  h@h.com   서울시 관악구
1  신길동   40  s@h.com  서울시 영등포구
2  김길동   30  k@h.com   서울시 동작구

In [51]:
iris = pd.read_hdf('data/ch09_iris.hdf5', key='iris')
iris.head()  # 상위 5개
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# 2절. 데이터 프레임 만들기
## 2.1 딕셔너리를 이용해서 데이터프레임 만들기

In [52]:
d = {'kor' : [100, 90], 'mat' : [95, 99]}  # 딕셔너리를 데이터프레임으로

df = pd.DataFrame(data=d)
df

   kor  mat
0  100   95
1   90   99

In [53]:
df.to_dict()  # 데이터 프레임을 딕셔너리로 변환

{'kor': {0: 100, 1: 90}, 'mat': {0: 95, 1: 99}}

In [54]:
df.to_numpy()

array([[100,  95],
       [ 90,  99]], dtype=int64)

In [57]:
# 딕셔너리 리스트를 데이터프레임으로
d = [{'kor' : 100, 'math' : 95},  
    {'kor' : 90., 'math' : 99}]
df = pd.DataFrame(d)
df

     kor  math
0  100.0    95
1   90.0    99

In [60]:
df.dtypes

kor     float64
math      int64
dtype: object

In [61]:
df.info()  # 중요!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      float64
 1   math    2 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [64]:
d = [{'kor' : 100, 'math' : 95},  
    {'kor' : 90, 'mathh' : 91},
    {'kor' : 93}]
df = pd.DataFrame(d)  # 결측치는 실수형이다. 정수형 변환불가(결측치 대체를 한 뒤 정수형 변환)
df

   kor  math  mathh
0  100  95.0    NaN
1   90   NaN   91.0
2   93   NaN    NaN

## 2.2 리스트를 이용해서 데이터 프레임 만들기

In [75]:
title = ['책1', '책2', '책3']
price = [ 15000, 18000, 20000]
df = pd.DataFrame(data={'title':title, 'price':price})
df

  title  price
0    책1  15000
1    책2  18000
2    책3  20000

In [73]:
l = [['책1', '책2', '책3'],
     [ 15000, 18000, 20000]]
l
import numpy as np
l_ = np.c_[l[0],l[1]]
l_

array([['책1', '15000'],
       ['책2', '18000'],
       ['책3', '20000']], dtype='<U11')

In [74]:
df = pd.DataFrame(l_, columns=['책이름', '가격'])
df

  책이름     가격
0  책1  15000
1  책2  18000
2  책3  20000

## 2.3 read_csv

In [78]:
%ls C:\ai_x\download\shareData\상가정보_20250331

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 3664-591E

 C:\ai_x\download\shareData\상가정보_20250331 디렉터리

2025-04-28  오후 03:49    <DIR>          .
2025-04-28  오후 03:49    <DIR>          ..
2025-04-21  오후 03:13             1,011 [필독]파일열람방법.txt
2025-04-21  오후 03:21        61,227,944 소상공인시장진흥공단_상가(상권)정보_강원_202503.csv
2025-04-21  오후 03:21       356,572,082 소상공인시장진흥공단_상가(상권)정보_경기_202503.csv
2025-04-21  오후 03:22        93,472,559 소상공인시장진흥공단_상가(상권)정보_경남_202503.csv
2025-04-21  오후 03:22        76,425,275 소상공인시장진흥공단_상가(상권)정보_경북_202503.csv
2025-04-21  오후 03:22        40,070,868 소상공인시장진흥공단_상가(상권)정보_광주_202503.csv
2025-04-21  오후 03:22        61,715,005 소상공인시장진흥공단_상가(상권)정보_대구_202503.csv
2025-04-21  오후 03:23        41,491,092 소상공인시장진흥공단_상가(상권)정보_대전_202503.csv
2025-04-21  오후 03:23        84,550,600 소상공인시장진흥공단_상가(상권)정보_부산_202503.csv
2025-04-21  오후 03:23       294,549,483 소상공인시장진흥공단_상가(상권)정보_서울_202503.csv
2025-04-21  오후 03:23         9,303,432 소상공인시장진흥공단_상가(상권)정보_세종_202503.csv
2025-04-21  오후 03:23        28,457,489 소상공인시장진흥공단_상가(상권)정보_울산_202503.csv
2025-04-21  오후 03:23        73,022,149 소상공인시장진흥공단_상가(상권)정보_인천_202503.csv
2025-04-21  오후 03:23        52,997,974 소상공인시장진흥공단_상가(상권)정보_전남_202503.csv
2025-04-21  오후 03:24        56,252,705 소상공인시장진흥공단_상가(상권)정보_전북_202503.csv
2025-04-21  오후 03:24        32,943,677 소상공인시장진흥공단_상가(상권)정보_제주_202503.csv
2025-04-21  오후 03:24        66,591,896 소상공인시장진흥공단_상가(상권)정보_충남_202503.csv
2025-04-21  오후 03:21        50,727,673 소상공인시장진흥공단_상가(상권)정보_충북_202503.csv
              18개 파일       1,480,372,914 바이트
               2개 디렉터리  147,072,880,640 바이트 남음

In [80]:
df = pd.read_csv(r'C:\ai_x\download\shareData\상가정보_20250331\소상공인시장진흥공단_상가(상권)정보_세종_202503.csv',
                # encoding='utf-8',  
                # sep = ',',
                low_memory=False,
                nrows=30  # 처음 30행만                 
                )
df.shape

(30, 39)

### 2.3.0 판다스 디스플레이 옵션

In [84]:
pd.options.display.max_columns = 39 # 기본값 : 20. 39열까지 display 가능
pd.options.display.max_rows = 40 # 기본값 : 60. 40행까지 display 가능

In [85]:
df.head(1).T

                                   0
상가업소번호          MA010120220700019175
상호명                       세종수이비인후과의원
지점명                              NaN
상권업종대분류코드                         Q1
상권업종대분류명                        보건의료
상권업종중분류코드                       Q102
상권업종중분류명                          의원
상권업종소분류코드                     Q10201
상권업종소분류명                   내과/소아과 의원
표준산업분류코드                      Q86201
표준산업분류명                         일반의원
시도코드                              36
시도명                          세종특별자치시
시군구코드                          36110
시군구명                         세종특별자치시
행정동코드                       36110525
행정동명                             해밀동
법정동코드                     3611011600
법정동명                             해밀동
지번코드             3611011600200050002
대지구분코드                             2
대지구분명                              산
지번본번지                              5
지번부번지                            2.0
지번주소        세종특별자치시 세종특별자치시 해밀동 산5-2
도로명코드                   361103352828
도로명             세종특별자치시 세종특별자치시 해밀3로
건물본번지                             43
건물부번지                            NaN
건물관리번호     3611011600200050002000001
건물명                         행정중심복합도시
도로명주소        세종특별자치시 세종특별자치시 해밀3로 43
구우편번호                            NaN
신우편번호                          30092
동정보                              NaN
층정보                              NaN
호정보                              NaN
경도                        127.264487
위도                         36.528585

### 2.3.1 CSV 파일 불러오기(기본값)

In [105]:

# encoding='utf-8', sep=',', 첫줄이 header, 두번째 줄부터 data
member = pd.read_csv('data/ch11_member.csv')
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [106]:
# 형변환 age 열 : int63 -> int16
import numpy as np
member['Age'] = member['Age'].astype('int16') # 'int' : np.int32
member['Age']

0    20
1    30
2    21
3    22
4    23
5    24
Name: Age, dtype: int16

In [107]:
# 형변환 Birth 열 : object(문자) -> datetime64[ns] (최신버전)
member['Birth_as'] = member['Birth'].astype('datetime64')

In [109]:
member['Birth_to'] = pd.to_datetime(member['Birth']) # astype()함수보다 안전한 형변환

In [110]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
 6   Birth_to  6 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int16(1), object(4)
memory usage: 428.0+ bytes

### 2.3.2 특정행 제외하고 CSV 파일 읽기

In [114]:
# (2) 특정행 제외하고 CSV 파일 읽기
member = pd.read_csv('data/ch11_membercp949.csv', 
                    encoding='cp949',
                    skiprows=[1, 6]  # skiprows=[idx1, idx2] idx1번째 행, idx2번째 행 제외하고 읽어오기
                    )
member

  Name  Age         Email  Address       Birth
0  홍길서   30  seo@hong.com   서울시 중구  1999-12-01
1  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01
2  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
3  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

### 2.3.3 주석(#) 제외, datetime형 필드 지정하여 읽기

In [117]:
# (3) 주석(#) 제외, datetime형 필드 지정하여 읽기
member = pd.read_csv('data/ch11_member_tab.csv', 
                    sep='\t',
                    comment='#',
                    parse_dates=['Birth']) # datetime 형으로 읽어올 필드 지정
member.info(), member

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Email    5 non-null      object
 3   Address  5 non-null      object
 4   Birth    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 328.0+ bytes

(None,
   Name  Age          Email  Address      Birth
 0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
 1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
 2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
 3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
 4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30)

In [123]:
# (4) sep='|', 상위 5행만 읽어오기
df = pd.read_csv('data/ch11_membersep.csv', 
                sep='|',
                nrows=2)  # nrows=2 <- 2번 행까지 가져온다 (헤더가 0행)
df

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01

## 2.4 패키지에서 가져오기 : iris데이터
- iris 가져오기 방법-1 : sklearn (머신러닝 패키지)  
- iris 가져오기 방법-2 : statsmodels (R 데이터)
- iris 가져오기 방법-3 : seaborn (시각화 패키지)  padas 데이터프레임
### iris 가져오기 방법-1 : sklearn (머신러닝 패키지)

In [126]:
from sklearn import datasets
# sklearn : 머신러닝을 위한 패키지(전처리 함수, 머신러닝, 성능평가를 위한 함수, 학습 데이터 셋 등이 대거 있음)
iris = datasets.load_iris()
iris.keys() # 딕셔너리 형태

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [127]:
print(iris.DESCR)  # iris 데이터 셋에 대한 설명

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica

    :Summary Statistics:

    ============== ==== ==== ======= ===== ====================
                    Min  Max   Mean    SD   Class Correlation
    ============== ==== ==== ======= ===== ====================
    sepal length:   4.3  7.9   5.84   0.83    0.7826
    sepal width:    2.0  4.4   3.05   0.43   -0.4194
    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
    ============== ==== ==== ======= ===== ====================

    :Missing Attribute Values: None
    :Class Distribution: 33.3% for each of 3 classes.
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. topic:: References

   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
     Mathematical Statistics" (John Wiley, NY, 1950).
   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
     Structure and Classification Rule for Recognition in Partially Exposed
     Environments".  IEEE Transactions on Pattern Analysis and Machine
     Intelligence, Vol. PAMI-2, No. 1, 67-71.
   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
     on Information Theory, May 1972, 431-433.
   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
     conceptual clustering system finds 3 classes in the data.
   - Many, many more ...

In [128]:
iris.data # 독립변수
iris['data'][:3]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2]])

In [131]:
iris.feature_names
iris['feature_names_mdfy'] = iris['feature_names']

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [137]:
# 데이터프레임에서 열이름
feature_names_mdfy = [ col[:-5].replace(' ', '_') for col in iris.feature_names] + ['specises']
feature_names_mdfy

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'specises']

In [ ]:
import seaborn as sns
sns.load_dataset

In [144]:
iris.target     # target 머신러닝시 종속 변수
iris['target']

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [145]:
iris.target_names[ iris.target ]

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [147]:
# 독립변수
data = iris.data
target = iris.target_names[ iris.target ]
data.shape, target.shape  # 150행으로 행 수 일치

((150, 4), (150,))

In [152]:
# 독립 변수와 종속변수를 stack 한 후
pd.DataFrame(data = np.hstack( (data, target[:,np.newaxis]) ),
            columns=feature_names_mdfy)

    sepal_length sepal_width petal_length petal_width   specises
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

### iris 가져오기 방법-2 : statsmodels (R 데이터)

### iris 가져오기 방법-3 : seaborn (시각화 패키지)